In [14]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [42]:
car_sales = pd.read_csv('car_sales_export.csv')
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [43]:
# Rename the columns 
car_sales.columns = car_sales.columns.str.lower().str.replace(' ', '_')
car_sales

     make colour  odometer_(km)  doors       price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [50]:
car_sales['odometer_(km)'].dtypes

dtype('int64')

In [53]:
car_sales.make.dtypes

dtype('O')

In [55]:
car_sales.price = car_sales.price.str.replace('[\$\,]', '')

car_sales

<ipython-input-55-7dab505006a3>:1: FutureWarning: The default value of regex will change from True to False in a future version.
  car_sales.price = car_sales.price.str.replace('[\$\,]', '')

     make colour  odometer_(km)  doors     price
0  Toyota  White         150043      4   4000.00
1   Honda    Red          87899      4   5000.00
2  Toyota   Blue          32549      3   7000.00
3     BMW  Black          11179      5  22000.00
4  Nissan  White         213095      4   3500.00
5  Toyota  Green          99213      4   4500.00
6   Honda   Blue          45698      4   7500.00
7   Honda   Blue          54738      4   7000.00
8  Toyota  White          60000      4   6250.00
9  Nissan  White          31600      4   9700.00

In [56]:
car_sales.price.dtypes

dtype('O')

In [58]:
#convert the price column to float
car_sales.price = car_sales.price.astype(float)

car_sales.price.dtypes

dtype('float64')

In [61]:
try:
    age = int(input('What is your age? '))
    print(age)
except:
    print('invalid entry please write a number')

What is your age? sixty
invalid entry please write a number

In [62]:
#Placeholder function (%s): this fills a statement with another string as called in the statement

a = 'bayo'

b = 'segun'

print('this is my guy %s' %(a))

this is my guy bayo

In [71]:
# Classes: this is more used in machine learning to group objects 
class Person:
    def __init__(self, fname, lname, weight, height, scolor):
        self.fname = fname
        self.lname = lname 
        self.weight = weight
        self.height = height
        self.scolor = scolor

person = Person('Bimbo', 'Adeniji', 101, 200, 'brown') #instance of a class (this is use to access 
                                                       # the attributes you of a person shown above
                                          
print(person.fname + ' '+ person.lname)

Bimbo Adeniji

In [29]:
class Account:
    def __init__ (self, name, balance):
        self.name = name
        self.balance = balance
        print("Tolu has an account balance of %s:" %(self.balance))
        
account = Account (
        "Tolu",
        "$1,000,000"
)

Tolu has an account balance of $1,000,000:

In [74]:
class Account:
    def __init__ (self, name, ac_bal, ac_num, gender):
        self.name = name
        self.ac_bal = ac_bal
        self.ac_num = ac_num
        self.gender = gender
        
account = Account('Tolu', '$100,000', '0049505552', 'male')

print('Tolu, your account balance is', account.ac_bal)

Tolu, your account balance is $100,000

In [75]:
class Account:
    def __init__ (self, name, ac_bal, ac_num, gender):
        self.name = name
        self.ac_bal = ac_bal
        self.ac_num = ac_num
        self.gender = gender
        
account = Account('Tolu', '$100,000', '0049505552', 'male')
print('Tolu, your account balance is %s' %(account.ac_bal))

Tolu, your account balance is $100,000

In [ ]:
#NOTE: To comment a number of statement together, use the (Ctrl /)

In [75]:
#Maths in python
#Using round 

num3 = 58.8278
print(round(num3, 2))

58.83

In [72]:
#abs: this is the absolute (positive) value of the specified number
#Ex 1
a = -10
abs(a)

10

In [44]:
#Ex 2

x = abs(-9.67)

x

9.67

In [65]:
#pow: pow(a,b), this returns the value of a raise to power of b (a^b)
#Ex 1
a = 20
b = 2

pow(a,b)

400

In [63]:
# Same as **
a = 20
b = 2

a**b

400

In [45]:
#Ex 2
a = 10
b = 3

pow(a, b)

1000

In [69]:
# sqrt: this finds the square root of numbers 
import math #You can click on the Shift Tab to find out more about functions

math.sqrt(81)

9.0

In [71]:
# ceil(): this rounds a number upwards to its nearest integer
# floor(): this rounds up a number downwards to its nearest integer 
#Ex 1

num1 = 20.3
num2 = 58.8

print(math.ceil(num1))
print(math.floor(num2))

21
58

In [47]:
#Ex 2

x = math.ceil(1.2)

y = math.floor(1.2)

print(x)
print(y)

2
1

In [76]:
# Importing datetime: syntax; datetime.
import datetime

In [79]:
today = datetime.datetime.now()
print(today)

2021-06-27 20:39:34.376633

In [80]:
a = datetime.datetime(1974, 7, 11)

print(a.strftime('%A')) #this will find the day of the week

Thursday

In [81]:
a = datetime.datetime(1980, 12, 31)

print(a.strftime('%A'))

Wednesday

In [82]:
a = datetime.datetime(1974, 7, 11)

print(a.strftime('%a'))

Thu

In [83]:
a = datetime.datetime(1974, 7, 11)

print(a.strftime('%B')) # this will find the month in full

July

In [84]:
a = datetime.datetime(1974, 7, 11)

print(a.strftime('%b')) # this will find the short version of the month

Jul

In [86]:
today = datetime.datetime.now()

print(today.strftime('%A')) #weekday
print(today.strftime('%B')) #month
print(today.strftime('%Y')) #year
print(today.strftime('%H')) #hour
print(today.strftime('%M')) #minute

Sunday
June
2021
20
55

In [78]:
# strftime (): The datetime object has a method for formatting date objects into readable
# strings. The method is called strftime () and takes one parameter, format, to specify 
# the format of the returned string. 

# Example: Display the name of the month

a = datetime.datetime(1980, 12, 3)

print(a.strftime("%B")) #%B: this is used to determine the full name of a month

December

In [52]:
print(a.strftime('%A'))

Wednesday

In [53]:
print(today.strftime('%B'))#month

June

In [55]:
print(today.strftime('%A'))# Day of the week

Sunday

In [56]:
print(today.strftime('%H')) #hour of the day

19

In [57]:
print(today.strftime('%M'))#minute of the day

40

In [59]:
print(today.strftime('%W'))#week of the year

25

In [90]:
a = datetime.datetime.now()

print(a.year)
print(a.strftime("%b"))
print(a.strftime("%a"))
print(a.month)
print(a.hour)
print(a.minute)

2021
Jun
Sun
6
20
57